README.md
  ```mermaid
  flowchart LR
    subgraph API
      AuthCtrl[AuthController]
      LancCtrl[LancamentosController]
      RelCtrl[RelatoriosController]
    end

    subgraph Application
      Med[MediatR]
      Cmd[Commands]
      Qry[Queries]
      Val[Validators]
    end

    subgraph Domain
      User[User]
      Lanc[Lancamento]
      RT[RefreshToken]
      Tipo[TipoLancamento]
    end

    subgraph Infrastructure
      Db[AppDbContext]
      Jwt[JwtTokenGenerator]
      RTSvc[RefreshTokenService]
      Pwd[PasswordHasher]
    end

    AuthCtrl --> Med
    LancCtrl --> Med
    RelCtrl  --> Med
    Med --> Cmd
    Med --> Qry
    Cmd --> Db
    Qry --> Db
    Db --> User
    Db --> Lanc
    Db --> RT
    Pwd -. usado por .-> Cmd
    Jwt -. usado por .-> AuthCtrl
    RTSvc -. usado por .-> AuthCtrl
  ```
