README.md
  ```mermaid
  sequenceDiagram
    autonumber
    actor User as Usuário
    participant Web as WebApp
    participant API
    participant DB as PostgreSQL

    User->>Web: Solicita (de/até, saldoInicial)
    Web->>API: GET /api/v1/relatorios/saldo-diario
    API->>DB: SELECT lancamentos (group by data)
    DB-->>API: Débitos/Créditos por dia
    API->>API: Calcula saldo do dia e acumulado
    API-->>Web: JSON diário
    Web-->>User: Tabela + Gráfico
  ```
